Revit 2026 API

# TableSectionDataFirstColumnNumber Property

---

The first column in this section of the table.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int FirstColumnNumber { get; }
```
```vb
Public ReadOnly Property FirstColumnNumber As Integer
	Get
```
```cpp
public:
property int FirstColumnNumber {
	int get ();
}
```
```fsharp
member FirstColumnNumber : int with get
```

#### Property Value

Int32

Some table sections have column 0 as their first column while others start with column 1.

#### Reference

TableSectionData Class

Autodesk.Revit.DB Namespace